ycsb-results/mssql/f/rc10-op5/tc4/run1.txt
/usr/bin/java  -classpath /home/atz2nd/Desktop/editycsb/YCSB/conf:/home/atz2nd/Desktop/editycsb/YCSB/core/target/core-0.17.0-SNAPSHOT.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/src/main/conf:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/jdbc-mssql-binding-0.17.0-SNAPSHOT.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/HdrHistogram-2.1.9.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/commons-collections-3.2.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/commons-lang-2.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/commons-pool-1.5.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/geronimo-jms_1.1_spec-1.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/geronimo-jta_1.1_spec-1.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/htrace-core4-4.2.0-incubating.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/mssql-jdbc-6.4.0.jre8.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/openjpa-jdbc-2.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/openjpa-kernel-2.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/openjpa-lib-2.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/serp-1.13.1.jar com.yahoo.ycsb.Client -t -db com.yahoo.ycsb.db.JdbcDBClient -s -P /home/atz2nd/Desktop/editycsb/YCSB/mssql/db.properties -P /home/atz2nd/Desktop/editycsb/YCSB/workloads/workloadf -p recordcount=10 -threads 4 -p operationcount=5
Adding shard node URL: jdbc:sqlserver://localhost:1433;databaseName=ycsb
Adding shard node URL: jdbc:sqlserver://localhost:1433;databaseName=ycsb
Adding shard node URL: jdbc:sqlserver://localhost:1433;databaseName=ycsb
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
[OVERALL], RunTime(ms), 791
[OVERALL], Throughput(ops/sec), 6.321112515802781
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 5
[READ], AverageLatency(us), 75401.6
[READ], MinLatency(us), 63968
[READ], MaxLatency(us), 78399
[READ], 95thPercentileLatency(us), 78399
[READ], 99thPercentileLatency(us), 78399
[READ], Return=OK, 5
[READ-MODIFY-WRITE], Operations, 3
[READ-MODIFY-WRITE], AverageLatency(us), 253226.66666666666
[READ-MODIFY-WRITE], MinLatency(us), 187648
[READ-MODIFY-WRITE], MaxLatency(us), 317695
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 317695
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 317695
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 115.75
[CLEANUP], MinLatency(us), 49
[CLEANUP], MaxLatency(us), 246
[CLEANUP], 95thPercentileLatency(us), 246
[CLEANUP], 99thPercentileLatency(us), 246
[UPDATE], Operations, 3
[UPDATE], AverageLatency(us), 159093.33333333334
[UPDATE], MinLatency(us), 95296
[UPDATE], MaxLatency(us), 224383
[UPDATE], 95thPercentileLatency(us), 224383
[UPDATE], 99thPercentileLatency(us), 224383
[UPDATE], Return=OK, 3